app/Controllers/PegawaiController.php

SELECT *
FROM `pegawai`
---
    public function index()
    {
        $pegawaiModel = new PegawaiModel();
        $data['pegawai'] = $pegawaiModel->findAll();

SELECT *
FROM `pegawai`
WHERE `pegawai`.`id` = '1'
---
    public function edit($id)
    {
        $pegawaiModel = new PegawaiModel();
        $data['pegawai'] = $pegawaiModel->find($id);